STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.c
/** @addtogroup STM32U5xx_HAL_Driver
  * @{
  */

/** @addtogroup SDMMC_CORE SDMMC Core
  * @{
  */

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/
#ifndef NULL
#define NULL ((void *)0U)
#endif /* NULL */
/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Private_Functions SDMMC CORE Private Functions
  * @{
  */
static uint32_t SDMMC_WaitFlagUntilTimeout(const SDMMC_TypeDef *sdmmcx, uint32_t flag_mask, uint32_t timeout_ms);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup SDMMC_CORE_Exported_Functions SDMMC Core Exported Functions
  * @{
  */

/** @addtogroup SDMMC_CORE_Group1 Set and Get Configurations functions
  * @{
This section provides functions allowing to Get and Set the SDMMC configuration:
- Call the function SDMMC_GetConfig() to get the sdmmc configuration.
- Call the function SDMMC_SetConfig() to set the sdmmc configuration.
  */
/**
  * @brief Get the SDMMC config according to the specified parameters.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param p_config Pointer to SDMMC configuration.
  */
void SDMMC_GetConfig(SDMMC_TypeDef *sdmmcx, sdmmc_config_t *p_config)
{
  p_config->clk.clock_div         = (sdmmcx->CLKCR & SDMMC_CLKCR_CLKDIV);
  p_config->clk.clock_edge        = (sdmmcx->CLKCR & SDMMC_CLKCR_NEGEDGE);
  p_config->clk.clock_power_save  = (sdmmcx->CLKCR & SDMMC_CLKCR_PWRSAV);
  p_config->bus_wide              = (sdmmcx->CLKCR & SDMMC_CLKCR_WIDBUS);
  p_config->hardware_flow_control = (sdmmcx->CLKCR & SDMMC_CLKCR_HWFC_EN);
}

/**
  * @brief Set the SDMMC config according to the specified parameters in the sdmmc_config_t.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param p_config Pointer to SDMMC configuration structure.
  */
void SDMMC_SetConfig(SDMMC_TypeDef *sdmmcx, const sdmmc_config_t *p_config)
{
  if (p_config->tranceiver_present == SDMMC_TRANSCEIVER_PRESENT)
  {
    /* Set transceiver polarity */
    sdmmcx->POWER |= SDMMC_POWER_DIRPOL;
  }

  MODIFY_REG(sdmmcx->CLKCR, CLKCR_CLEAR_MASK, (p_config->clk.clock_edge | p_config->clk.clock_power_save \
                                               | p_config->bus_wide | p_config->hardware_flow_control    \
                                               | p_config->clk.clock_div));
}
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group2 Peripheral Control functions
  * @{
    This subsection provides a set of functions allowing to control the SDMMC data transfers.
  */
/**
  * @brief Configure the SDMMC command path according to the specified parameters in sdmmc_cmd_init_t structure
  *        and send the command.
  * @param sdmmcx    Pointer to SDMMC register base.
  * @param p_command Pointer to a sdmmc_cmd_init_t structure.
  */
void SDMMC_SendCommand(SDMMC_TypeDef *sdmmcx, const sdmmc_cmd_init_t *p_command)
{
  sdmmcx->ARGR = p_command->argument;
  MODIFY_REG(sdmmcx->CMDR, CMD_CLEAR_MASK, (p_command->cmd_index | p_command->response | p_command->wait_for_interrupt \
                                            | p_command->cpsm));
}

/**
  * @brief Configure the SDMMC data path according to the specified parameters in the sdmmc_data_ctrl_t.
  * @param sdmmcx      Pointer to SDMMC register base.
  * @param p_data_ctrl Pointer to a sdmmc_data_ctrl_t structure that contains the configuration information
  *                    for the SDMMC data.
  */
void SDMMC_ConfigData(SDMMC_TypeDef *sdmmcx, const sdmmc_data_ctrl_t *p_data_ctrl)
{
  sdmmcx->DTIMER = p_data_ctrl->data_timeout;
  sdmmcx->DLENR = p_data_ctrl->data_length;
  MODIFY_REG(sdmmcx->DCTRL, DCTRL_CLEAR_MASK, (p_data_ctrl->data_block_size | p_data_ctrl->transfer_dir \
                                               | p_data_ctrl->transfer_mode | p_data_ctrl->dpsm));
}
/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group3 SDMMC Commands management and Data transfers functions
  * @{
This subsection provides a set of functions allowing to manage the needed commands.
  */
/**
  * @brief Send the Data Block Length command and check the response.
  * @param sdmmcx     Pointer to SDMMC register base.
  * @param block_size Block size to configure.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendBlockLengthCmd(SDMMC_TypeDef *sdmmcx, uint32_t block_size)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = block_size;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SET_BLOCKLEN;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SET_BLOCKLEN, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Block count command and check the response
  * @param SDMMCx      Pointer to SDMMC register base
  * @param block_count Block count
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendBlockCountCmd(SDMMC_TypeDef *SDMMCx, uint32_t block_count)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t errorstate;

  /* Set Block Size for Card */
  sdmmc_cmdinit.argument           = (uint32_t)block_count;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SET_BLOCK_COUNT;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

  /* Check for error conditions */
  errorstate = SDMMC_GetCmdResp1(SDMMCx, SDMMC_CMD_SET_BLOCK_COUNT, SDMMC_CMD_TIMEOUT);

  return errorstate;
}

/**
  * @brief Send the Read Single/Multi Block command and check the response.
  * @param sdmmcx        Pointer to SDMMC register base.
  * @param read_addr     Address from where data is to be read.
  * @param read_blk_type Type of read iteration (Single or Multiple type).
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendReadBlocksCmd(SDMMC_TypeDef *sdmmcx, uint32_t read_addr, uint32_t read_blk_type)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = read_addr;
  sdmmc_cmdinit.cmd_index          = read_blk_type;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, (uint8_t)read_blk_type, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Write Single/Multi Block command and check the response.
  * @param sdmmcx         Pointer to SDMMC register base.
  * @param write_addr     Address from where data is to be written.
  * @param write_blk_type Type of write iteration (Single or Multiple type).
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendWriteBlocksCmd(SDMMC_TypeDef *sdmmcx, uint32_t write_addr, uint32_t write_blk_type)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = write_addr;
  sdmmc_cmdinit.cmd_index          = write_blk_type;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, (uint8_t)write_blk_type, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Start Address Erase command and check the response.
  * @param sdmmcx           Pointer to SDMMC register base.
  * @param start_addr       Start Block address.
  * @param cmd_erase        Command of erase type.
  * @param erase_timeout_ms Erase timeout value.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendEraseCmd(SDMMC_TypeDef *sdmmcx, uint32_t start_addr, uint32_t cmd_erase, uint32_t erase_timeout_ms)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = start_addr;
  sdmmc_cmdinit.cmd_index          = cmd_erase;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, (uint8_t)cmd_erase, erase_timeout_ms);

  return error_code;
}

/**
  * @brief Send the Stop Transfer command and check the response.
  * @param sdmmcx                   Pointer to SDMMC register base.
  * @param stop_transfer_timeout_ms Stop transfer timeout duration.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendStopTransferCmd(SDMMC_TypeDef *sdmmcx, uint32_t stop_transfer_timeout_ms)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_STOP_TRANSMISSION;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;

  SDMMC_CMDSTOP_ENABLE(sdmmcx);
  SDMMC_CMDTRANS_DISABLE(sdmmcx);
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);
  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_STOP_TRANSMISSION, stop_transfer_timeout_ms);
  SDMMC_CMDSTOP_DISABLE(sdmmcx);

