STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.c
  /* Ignore Address Out Of Range Error, not relevant at end of memory */
  if (error_code == SDMMC_ERROR_ADDR_OUT_OF_RANGE)
  {
    error_code = SDMMC_ERROR_NONE;
  }

  return error_code;
}

/**
  * @brief Send the Select Deselect command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @param addr   Address of the card to be selected.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendSelDeselCmd(SDMMC_TypeDef *sdmmcx, uint32_t addr)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = addr;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SEL_DESEL_CARD;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SEL_DESEL_CARD, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Go Idle State command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendGoIdleStateCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_GO_IDLE_STATE;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_NO;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  /** 8 is the number of required instructions cycles for the below loop statement.
    * The SDMMC_CMD_TIMEOUT is expressed in ms.
    */
  uint32_t count = SDMMC_CMD_TIMEOUT * (SystemCoreClock / 22U / 1000U);

  do
  {
    count--;
    if (count == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }

  } while (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CMDSENT) == 0U);

  SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Send the Operating Condition command and check the response.
  * @param  sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendOperCondCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  /** Send CMD8 to verify SD card interface operating condition.
    *  argument: - [31:12]: Reserved (must be set to '0')
    *  - [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    *  - [7:0]: Check Pattern (recommended 0xAA)
    */
  sdmmc_cmdinit.argument           = SDMMC_CHECK_PATTERN;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_HS_SEND_EXT_CSD;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp7(sdmmcx);

  return error_code;
}

/**
  * @brief Send the Application command to verify that that the next command is an application specific command
  *        rather than a standard command and check the response.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument Command argument.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendAppCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_APP_CMD;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_APP_CMD, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the command asking the accessed card to send its operating condition register (OCR).
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument Command argument.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendAppOperCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SD_APP_OP_COND;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp3(sdmmcx);

  return error_code;
}

/**
  * @brief Send the Bus Width command and check the response.
  * @param sdmmcx    Pointer to SDMMC register base.
  * @param bus_width Bus width.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendBusWidthCmd(SDMMC_TypeDef *sdmmcx, uint32_t bus_width)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = bus_width;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_APP_SD_SET_BUSWIDTH;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_APP_SD_SET_BUSWIDTH, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Send SCR command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendSCRCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SD_APP_SEND_SCR;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SD_APP_SEND_SCR, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Send CID command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendCIDCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_ALL_SEND_CID;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_LONG;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

