STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.c
  error_code = SDMMC_GetCmdResp2(sdmmcx);

  return error_code;
}

/**
  * @brief Send the Send CSD command and check the response.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument Command argument.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendCSDCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SEND_CSD;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_LONG;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp2(sdmmcx);

  return error_code;
}

/**
  * @brief Send the Send CSD command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @param p_rca  Card relative address (RCA).
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SD_SendRelativeAddrCmd(SDMMC_TypeDef *sdmmcx, uint16_t *p_rca)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SET_REL_ADDR;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp6(sdmmcx, SDMMC_CMD_SET_REL_ADDR, p_rca);

  return error_code;
}

/**
  * @brief Send command to Set Relative Address MMC card (not SD card).
  * @param sdmmcx Pointer to SDMMC register base.
  * @param rca Card relative address (RCA).
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_MMC_SendRelativeAddrCmd(SDMMC_TypeDef *sdmmcx, uint16_t rca)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = ((uint32_t)rca << 16U);
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SET_REL_ADDR;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SET_REL_ADDR, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Sleep command to MMC card (not SD card).
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument argument of the command (RCA and Sleep/Awake).
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_MMC_SendSleepCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_MMC_SLEEP_AWAKE;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_MMC_SLEEP_AWAKE, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Status command and check the response.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument Command argument.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendStatusCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SEND_STATUS;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SEND_STATUS, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Status register command and check the response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendStatusRegisterCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0U;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SD_APP_STATUS;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_SD_APP_STATUS, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send host capacity support information and activates the card's initialization process.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument argument used for the command.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendOpConditionCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SEND_OP_COND;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp3(sdmmcx);

  return error_code;
}

/**
  * @brief Checks switchable function and switch card function.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument argument used for the command.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendSwitchCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  /* Send CMD6 to activate SDR50 Mode and Power Limit 1.44W */
  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_HS_SWITCH;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_HS_SWITCH, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the command asking the accessed card to send its operating condition register (OCR).
  * @param sdmmcx   Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_SendVoltageSwitchCmd(SDMMC_TypeDef *sdmmcx)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = 0x00000000;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_VOLTAGE_SWITCH;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_VOLTAGE_SWITCH, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief Send the Send EXT_CSD command and check the response.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param argument Command argument.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_MMC_SendEXTCSDCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_HS_SEND_EXT_CSD;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp1(sdmmcx, SDMMC_CMD_HS_SEND_EXT_CSD, SDMMC_CMD_TIMEOUT);

  return error_code;
}

/**
  * @brief  Execute a cmd52 to write single byte data and read single byte data if needed
  * @param  sdmmcx: Pointer to SDMMC register base
  * @param  argument:  SDMMC command argument which is sent to a card as part of a command message
  * @param  p_response: pointer to response if needed
  * @retval SDIO Card error state
  */
uint32_t SDMMC_SDIO_SendReadWriteDirectCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument, uint8_t *p_response)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SDMMC_RW_DIRECT;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp5(sdmmcx, SDMMC_CMD_SDMMC_RW_DIRECT, p_response);

  return error_code;
}

/**
  * @brief  Execute a cmd53 to write or read multiple data with a single command
  * @param  sdmmcx: Pointer to SDMMC register base
  * @param  argument: SDMMC command argument which is sent to a card as part of a command message
  * @retval SDIO Card error state
  */
uint32_t SDMMC_SDIO_SendReadWriteExtendedCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SDMMC_RW_EXTENDED;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp5(sdmmcx, SDMMC_CMD_SDMMC_RW_EXTENDED, (uint8_t *) NULL);

  return error_code;
}

/**
  * @brief  Execute a cmd5 to write or read multiple data with a single command
  * @param  sdmmcx: Pointer to SDMMC register base
  * @param  argument: SDMMC command argument which is sent to a card as part of a command message
  * @param  p_response: pointer to response if needed
  * @retval SDIO Card error state
  */
uint32_t SDMMC_SDIO_SendOperationconditionCmd(SDMMC_TypeDef *sdmmcx, uint32_t argument, uint32_t *p_response)
{
  sdmmc_cmd_init_t sdmmc_cmdinit;
  uint32_t error_code;

  sdmmc_cmdinit.argument           = argument;
  sdmmc_cmdinit.cmd_index          = SDMMC_CMD_SDMMC_SEN_OP_COND;
  sdmmc_cmdinit.response           = SDMMC_RESPONSE_SHORT;
  sdmmc_cmdinit.wait_for_interrupt = SDMMC_WAIT_NO;
  sdmmc_cmdinit.cpsm               = SDMMC_CPSM_ENABLE;
  SDMMC_SendCommand(sdmmcx, &sdmmc_cmdinit);

  error_code = SDMMC_GetCmdResp4(sdmmcx, p_response);

  return error_code;
}
/**
  * @}
  */

