STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.c
/** @defgroup SDMMC_CORE_Group4 SDMMC Responses management functions
  * @{
This subsection provides a set of functions allowing to manage the needed responses.
  */

/**
  * @brief Checks for error conditions for R1 response.
  * @param sdmmcx       Pointer to SDMMC register base.
  * @param cmd          Command index.
  * @param timeout_ms   Timeout duration.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_GetCmdResp1(SDMMC_TypeDef *sdmmcx, uint8_t cmd, uint32_t timeout_ms)
{
  uint32_t response_r1;
  uint32_t error_code = SDMMC_ERROR_NONE;

  /* Polling for flags until timeout */
  (void)SDMMC_WaitFlagUntilTimeout(sdmmcx, (SDMMC_FLAG_CMDREND | SDMMC_FLAG_BUSYD0END), timeout_ms);

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);
    error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL);
    error_code = SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* Nothing to do */
  }

  if (error_code != SDMMC_ERROR_NONE)
  {
    return error_code;
  }

  SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);

  if (SDMMC_GetCommandResponse(sdmmcx) != cmd)
  {
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }

  response_r1 = SDMMC_GetResponse(sdmmcx, SDMMC_RESP1);

  if ((response_r1 & SDMMC_OCR_ERRORBITS) == SDMMC_ALLZERO)
  {
    error_code = SDMMC_ERROR_NONE;
  }
  else if ((response_r1 & SDMMC_OCR_ADDR_OUT_OF_RANGE) == SDMMC_OCR_ADDR_OUT_OF_RANGE)
  {
    error_code = SDMMC_ERROR_ADDR_OUT_OF_RANGE;
  }
  else if ((response_r1 & SDMMC_OCR_ADDR_MISALIGNED) == SDMMC_OCR_ADDR_MISALIGNED)
  {
    error_code = SDMMC_ERROR_ADDR_MISALIGNED;
  }
  else if ((response_r1 & SDMMC_OCR_BLOCK_LEN_ERR) == SDMMC_OCR_BLOCK_LEN_ERR)
  {
    error_code = SDMMC_ERROR_BLOCK_LEN_ERR;
  }
  else if ((response_r1 & SDMMC_OCR_ERASE_SEQ_ERR) == SDMMC_OCR_ERASE_SEQ_ERR)
  {
    error_code = SDMMC_ERROR_ERASE_SEQ_ERR;
  }
  else if ((response_r1 & SDMMC_OCR_BAD_ERASE_PARAM) == SDMMC_OCR_BAD_ERASE_PARAM)
  {
    error_code = SDMMC_ERROR_BAD_ERASE_PARAM;
  }
  else if ((response_r1 & SDMMC_OCR_WRITE_PROT_VIOLATION) == SDMMC_OCR_WRITE_PROT_VIOLATION)
  {
    error_code = SDMMC_ERROR_WRITE_PROT_VIOLATION;
  }
  else if ((response_r1 & SDMMC_OCR_LOCK_UNLOCK_FAILED) == SDMMC_OCR_LOCK_UNLOCK_FAILED)
  {
    error_code = SDMMC_ERROR_LOCK_UNLOCK_FAILED;
  }
  else if ((response_r1 & SDMMC_OCR_COM_CRC_FAILED) == SDMMC_OCR_COM_CRC_FAILED)
  {
    error_code = SDMMC_ERROR_COM_CRC_FAILED;
  }
  else if ((response_r1 & SDMMC_OCR_ILLEGAL_CMD) == SDMMC_OCR_ILLEGAL_CMD)
  {
    error_code = SDMMC_ERROR_ILLEGAL_CMD;
  }
  else if ((response_r1 & SDMMC_OCR_CARD_ECC_FAILED) == SDMMC_OCR_CARD_ECC_FAILED)
  {
    error_code = SDMMC_ERROR_CARD_ECC_FAILED;
  }
  else if ((response_r1 & SDMMC_OCR_CC_ERROR) == SDMMC_OCR_CC_ERROR)
  {
    error_code = SDMMC_ERROR_CC_ERR;
  }
  else if ((response_r1 & SDMMC_OCR_STREAM_READ_UNDERRUN) == SDMMC_OCR_STREAM_READ_UNDERRUN)
  {
    error_code = SDMMC_ERROR_STREAM_READ_UNDERRUN;
  }
  else if ((response_r1 & SDMMC_OCR_STREAM_WRITE_OVERRUN) == SDMMC_OCR_STREAM_WRITE_OVERRUN)
  {
    error_code = SDMMC_ERROR_STREAM_WRITE_OVERRUN;
  }
  else if ((response_r1 & SDMMC_OCR_CID_CSD_OVERWRITE) == SDMMC_OCR_CID_CSD_OVERWRITE)
  {
    error_code = SDMMC_ERROR_CID_CSD_OVERWRITE;
  }
  else if ((response_r1 & SDMMC_OCR_WP_ERASE_SKIP) == SDMMC_OCR_WP_ERASE_SKIP)
  {
    error_code = SDMMC_ERROR_WP_ERASE_SKIP;
  }
  else if ((response_r1 & SDMMC_OCR_CARD_ECC_DISABLED) == SDMMC_OCR_CARD_ECC_DISABLED)
  {
    error_code = SDMMC_ERROR_CARD_ECC_DISABLED;
  }
  else if ((response_r1 & SDMMC_OCR_ERASE_RESET) == SDMMC_OCR_ERASE_RESET)
  {
    error_code = SDMMC_ERROR_ERASE_RESET;
  }
  else if ((response_r1 & SDMMC_OCR_AKE_SEQ_ERROR) == SDMMC_OCR_AKE_SEQ_ERROR)
  {
    error_code = SDMMC_ERROR_AKE_SEQ_ERR;
  }
  else
  {
    error_code = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
  }

  return error_code;
}

/**
  * @brief Checks for error conditions for R2 (CID or CSD) response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Card error code.
  */
uint32_t SDMMC_GetCmdResp2(SDMMC_TypeDef *sdmmcx)
{
  uint32_t error_code = SDMMC_ERROR_NONE;

  /* Polling for flags until timeout */
  (void)SDMMC_WaitFlagUntilTimeout(sdmmcx, (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND), SDMMC_CMD_TIMEOUT);

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);
    error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL);
    error_code =  SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* No error flag set */
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);
  }

  return error_code;
}

/**
  * @brief Checks for error conditions for R3 (OCR) response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Card error code.
  */
uint32_t SDMMC_GetCmdResp3(SDMMC_TypeDef *sdmmcx)
{
  uint32_t error_code = SDMMC_ERROR_NONE;

  /* Polling for flags until timeout */
  (void)SDMMC_WaitFlagUntilTimeout(sdmmcx, (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND), SDMMC_CMD_TIMEOUT);

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);
    error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);
  }

  return error_code;
}

/**
  * @brief  Checks for error conditions for R4 response.
  * @param  sdmmcx Pointer to SDMMC register base.
  * @param  p_resp Pointer to response.
  * @retval Card error state.
  */
uint32_t SDMMC_GetCmdResp4(SDMMC_TypeDef *sdmmcx, uint32_t *p_resp)
{
  uint32_t sta_reg;

  /* 8 is the number of required instructions cycles for the below loop statement.
  The SDMMC_CMD_TIMEOUT is expressed in ms */
  uint32_t count = SDMMC_CMD_TIMEOUT * (SystemCoreClock / 8U / 1000U);

  do
  {
    if (count-- == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }
    sta_reg = sdmmcx->STAR;
  } while (((sta_reg & (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT)) == 0U) \
           || ((sta_reg & SDMMC_FLAG_CMDACT) != 0U));

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);

    return SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else
  {
    /* Clear all the static flags */
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);
  }

  /* Clear all the static flags */
  SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);

  /* We have received response, retrieve it.  */
  *p_resp = SDMMC_GetResponse(sdmmcx, SDMMC_RESP1);

  return SDMMC_ERROR_NONE;
}

/**
  * @brief  Checks for error conditions for R5 (cmd52/cmd53) response.
  * @param  sdmmcx: Pointer to SDMMC register base.
  * @param  sdio_cmd: The sent command index.
  * @param  p_data: pointer to the read/write buffer needed for cmd52.
  * @retval Card error state.
  */
uint32_t SDMMC_GetCmdResp5(SDMMC_TypeDef *sdmmcx, uint8_t sdio_cmd, uint8_t *p_data)
{
  uint32_t response_r5;
  uint32_t sta_reg;

