STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_sdmmc_core.c
  /* 8 is the number of required instructions cycles for the below loop statement.
  The SDMMC_CMD_TIMEOUT is expressed in ms */
  uint32_t count = SDMMC_CMD_TIMEOUT * (SystemCoreClock / 8U / 1000U);

  do
  {
    if (count-- == 0U)
    {
      return SDMMC_ERROR_TIMEOUT;
    }
    sta_reg = sdmmcx->STAR;
  } while (((sta_reg & (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT)) == 0U) \
           || ((sta_reg & SDMMC_FLAG_CMDACT) != 0U));

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);

    return SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL);

    return SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* Nothing to do */
  }

  /* Check response received is of desired command */
  if (SDMMC_GetCommandResponse(sdmmcx) != sdio_cmd)
  {
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }

  /* Clear all the static flags */
  SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);

  /* We have received response, retrieve it.  */
  response_r5 = SDMMC_GetResponse(sdmmcx, SDMMC_RESP1);

  if ((response_r5 & SDMMC_SDIO_R5_ERRORBITS) == SDMMC_ALLZERO)
  {
    /* we only want 8 bit read or write data and the 8 bit response flags are masked in the data pointer */
    if (p_data != NULL)
    {
      *p_data = (uint8_t)(response_r5 & 0xFFU);
    }

    return SDMMC_ERROR_NONE;
  }
  else if ((response_r5 & SDMMC_SDIO_R5_OUT_OF_RANGE) == SDMMC_SDIO_R5_OUT_OF_RANGE)
  {
    return SDMMC_ERROR_ADDR_OUT_OF_RANGE;
  }
  else if ((response_r5 & SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER) == SDMMC_SDIO_R5_INVALID_FUNCTION_NUMBER)
  {
    return SDMMC_ERROR_INVALID_PARAMETER;
  }
  else if ((response_r5 & SDMMC_SDIO_R5_ILLEGAL_CMD) == SDMMC_SDIO_R5_ILLEGAL_CMD)
  {
    return SDMMC_ERROR_ILLEGAL_CMD;
  }
  else if ((response_r5 & SDMMC_SDIO_R5_COM_CRC_FAILED) == SDMMC_SDIO_R5_COM_CRC_FAILED)
  {
    return SDMMC_ERROR_COM_CRC_FAILED;
  }
  else
  {
    return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
  }
}

/**
  * @brief Checks for error conditions for R6 (RCA) response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @param cmd    Command index.
  * @param p_rca  Pointer to the variable that contain the SD card relative address RCA.
  * @retval Card error code.
  */
uint32_t SDMMC_GetCmdResp6(SDMMC_TypeDef *sdmmcx, uint8_t cmd, uint16_t *p_rca)
{
  uint32_t response_r1;
  uint32_t error_code = SDMMC_ERROR_NONE;

  /* Polling for flags until timeout */
  (void)SDMMC_WaitFlagUntilTimeout(sdmmcx, (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND), SDMMC_CMD_TIMEOUT);

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);

    error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }
  else if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL);

    error_code = SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* Nothing to do */
  }

  if (error_code != SDMMC_ERROR_NONE)
  {
    return error_code;
  }

  if (SDMMC_GetCommandResponse(sdmmcx) != cmd)
  {
    return SDMMC_ERROR_CMD_CRC_FAIL;
  }

  SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_STATIC_CMD_FLAGS);

  response_r1 = SDMMC_GetResponse(sdmmcx, SDMMC_RESP1);

  if ((response_r1 & (SDMMC_R6_GENERAL_UNKNOWN_ERROR | SDMMC_R6_ILLEGAL_CMD \
                      | SDMMC_R6_COM_CRC_FAILED)) == SDMMC_ALLZERO)
  {
    *p_rca = (uint16_t)(response_r1 >> 16);
  }
  else if ((response_r1 & SDMMC_R6_ILLEGAL_CMD) == SDMMC_R6_ILLEGAL_CMD)
  {
    error_code = SDMMC_ERROR_ILLEGAL_CMD;
  }
  else if ((response_r1 & SDMMC_R6_COM_CRC_FAILED) == SDMMC_R6_COM_CRC_FAILED)
  {
    error_code = SDMMC_ERROR_COM_CRC_FAILED;
  }
  else
  {
    error_code = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
  }

  return error_code;
}

/**
  * @brief Checks for error conditions for R7 response.
  * @param sdmmcx Pointer to SDMMC register base.
  * @retval Error code can be one of @ref SDMMC_error_types.
  */
uint32_t SDMMC_GetCmdResp7(SDMMC_TypeDef *sdmmcx)
{
  uint32_t error_code = SDMMC_ERROR_NONE;

  /* Polling for flags until timeout */
  (void)SDMMC_WaitFlagUntilTimeout(sdmmcx, (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND), SDMMC_CMD_TIMEOUT);

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CTIMEOUT);

    error_code = SDMMC_ERROR_CMD_RSP_TIMEOUT;
  }

  else if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CCRCFAIL);

    error_code = SDMMC_ERROR_CMD_CRC_FAIL;
  }
  else
  {
    /* Nothing to do */
  }

  if (SDMMC_IS_ACTIVE_FLAG(sdmmcx, SDMMC_FLAG_CMDREND))
  {
    SDMMC_CLEAR_FLAG(sdmmcx, SDMMC_FLAG_CMDREND);
  }

  return error_code;
}

/**
  * @}
  */

/** @defgroup SDMMC_CORE_Group5 SDMMC time calculation functions
  * @{
This subsection provides a function for SDMMC time calculation.
  */
/**
  * @brief Delay in milli-second.
  * @param sdmmcx   Pointer to SDMMC register base.
  * @param delay_ms Delay in ms value.
  */
void SDMMC_DelayMs(const SDMMC_TypeDef *sdmmcx, uint32_t delay_ms)
{
  __IO uint32_t count = delay_ms * (SystemCoreClock / 22U / 1000U);

  STM32_UNUSED(sdmmcx);

  while (count--)
  {
    /* Nothing to do */
  }
}
/**
  * @}
  */

/**
  * @}
  */

/* Private function --------------------------------------------------------------------------------------------------*/
/** @defgroup SDMMC_CORE_Private_Functions SDMMC CORE Private Functions
  * @{
  */
/**
  * @brief Wait for a flag state until timeout.
  * @param sdmmcx     Pointer to SDMMC register base.
  * @param flag_mask  Value of the flag expected.
  * @param timeout_ms Timeout duration.
  * @retval SDMMC_ERROR_TIMEOUT in case of timeout has occurred.
  * @retval SDMMC_ERROR_NONE    in case of no error has occurred.
  */
static uint32_t SDMMC_WaitFlagUntilTimeout(const SDMMC_TypeDef *sdmmcx, uint32_t flag_mask, uint32_t timeout_ms)
{
  uint32_t timeout = timeout_ms * (SystemCoreClock / 22U / 1000U);
  uint32_t status_reg;

  status_reg = READ_REG(sdmmcx->STAR);
  /* Repeat while timeout != 0U */
  while (((((status_reg & flag_mask) == 0U) || ((status_reg & SDMMC_FLAG_CMDACT) != 0U))) && (timeout > 0U))
  {
    timeout--;
    status_reg = READ_REG(sdmmcx->STAR);
  }

  if (timeout == 0U)
  {
    return SDMMC_ERROR_TIMEOUT;
  }

  return SDMMC_ERROR_NONE;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
